Renova/src/DataProcessors/ЗагрузкаМоделейПродукции/ЗагрузкаМоделейПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаМоделейПродукции</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Renova/src/Enums/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Запчасть</name>
  </enumValues>
</mdclass:Enum>

Renova/src/Catalogs/МоделиПродукции/МоделиПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МоделиПродукции</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорииНоменклатуры</name>
    <type>
      <types>EnumRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>СимвольныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Код7ки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Renova/src/DataProcessors/ЗагрузкаМоделейПродукции/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	ПоказатьОповещениеПользователя("Строк в таблице: " + Объект.ТаблицаЗагрузки.Количество());;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗнач = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗнач);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
		
	СозданоЭлементов = 0;
	ТаблицаЗначений = Объект.ТаблицаЗагрузки.Выгрузить();
	СоответствияГрупп = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыПродукции.Ссылка КАК Ссылка,
		|	ВидыПродукции.Наименование КАК Наименование,
		|	ВидыПродукции.IDСайта КАК IDСайта
		|ИЗ
		|	Справочник.ВидыПродукции КАК ВидыПродукции";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 НоваяГруппа = Справочники.МоделиПродукции.СоздатьГруппу();
		 НоваяГруппа.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		 НоваяГруппа.Записать(); 
		 
		 СоответствияГрупп[ВыборкаДетальныеЗаписи.Ссылка] = НоваяГруппа.Ссылка;
	КонецЦикла;
	
	// 1. Собираем все уникальные product_id для поиска
	// 2. Собираем все уникальные номенклатуры
	УникальныеID = Новый Массив; 
	УникальнаяНоменклатура = Новый Массив; 
	
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл
		Если УникальныеID.Найти(СтрокаДанных.product_id) = Неопределено Тогда  
			УникальныеID.Добавить(СтрокаДанных.product_id);
			Если СтрокаДанных.product_id = "" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Для ID номенклатуры
		Если УникальнаяНоменклатура.Найти(СтрокаДанных.id) = Неопределено Тогда  
			УникальнаяНоменклатура.Добавить(СтрокаДанных.id);
		КонецЕсли;
	КонецЦикла;
	
	
	// 2. Получаем соответствие IDСайта -> Ссылка на вид продукции
	СоответствиеВидовПродукции = СоответствияСервер.ПолучитьСоответствиеВидовПродукцииОбщая(УникальныеID);
	СоответствияНоменклатур = СоответствияСервер.ПолучитьСоответствиеНоменклатуры(УникальнаяНоменклатура);
	
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл 
		
		// Проверяем, существует ли уже номенклатура с таким IDСайта
		Если СоответствияНоменклатур[Число(СтрокаДанных.id)] <> Неопределено Тогда
			// Номенклатура уже существует, пропускаем создание
			Продолжить;			
		КонецЕсли; 
		
		НовыйЭлемент = Справочники.МоделиПродукции.СоздатьЭлемент();
		НовыйЭлемент.IDСайта = СтрокаДанных.id;
		НовыйЭлемент.Наименование = СтрокаДанных.title;
		НовыйЭлемент.СимвольныйКод = СтрокаДанных.code_chars;
		НовыйЭлемент.КатегорииНоменклатуры = Перечисления.КатегорииНоменклатуры.Товар;
		// 4. Устанавливаем вид продукции по соответствию
		Если СтрокаДанных.product_id <> Неопределено Тогда 
			ЧислоID= Число(СтрокаДанных.product_id);
			СсылкаНаВидПродукции = СоответствиеВидовПродукции[ЧислоID];
			Если СсылкаНаВидПродукции <> Неопределено Тогда
				НовыйЭлемент.ВидПродукции = СсылкаНаВидПродукции
				//НовыйЭлемент.Родитель = СсылкаНаВидПродукции;
			КонецЕсли; 
			СсылкаНаГруппу = СоответствияГрупп[СсылкаНаВидПродукции];
            Если СсылкаНаГруппу <> Неопределено Тогда
                НовыйЭлемент.Родитель = СсылкаНаГруппу;
            КонецЕсли;
		КонецЕсли;

		НовыйЭлемент.Записать(); 
		СозданоЭлементов = СозданоЭлементов + 1;
	КонецЦикла;
	
	ТекстСообщенияПользователю = СтрШаблон("Загружено и создано %1 элементов справочника", СозданоЭлементов);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщенияПользователю);

КонецПроцедуры


#КонецОбласти
